/* 
Dynamic file คือ file ที่มีการเปลี่ยนแปลงเนื้อหาหรือ file ที่มีการยืดหยุ่นไม่มีเนื้อหาตายตัวและทำงานตามเงื่อนไขที่กำหนดขึ้นมา
เช่น ให้แสดงผลเนื้อหาอ้างอิงตามข้อมูลที่อยู่ในฐานข้อมูล หรือ เนื้อหาอ้างอิงตามพื้นที่ของผู้ใช้งาน เป็นต้น โดยจะเรียก file ดังกล่าวว่า dynamic file
หรือ เรียกอีกชื่อว่า views&template

    - view คือ ส่วนที่ใช้ในการแสดงเนื้อหาใน web browser ในรูปแบบ dynamic web page โดยเนื้อหาที่จะแสดงสามารถเปลี่ยนแปลงได้
    เช่น ทำการดึงข้อมูลจากที่อื่นมาแสดงผลแล้วแทรกไปในส่วนที่ต้องการเรียกรูปแบบนี้ว่า template
    - template คือ หน้าตาแอพพลิเคชั่นเป็นส่วนที่ไว้ใช้แสดงผลข้อมูลผลลัพธ์จากากรประมวลผลข้อมูลในหน้าเว็บร่วมกับ HTML , CSS,JavaScript
    ไฟล์ของ template จะเก็บไว้ที่ folder ที่ชื่อว่า Views เท่านั้น (หรือ folder อื่นต้องไปตั้งค่าเพิ่มเติม)

    

*/