/* 
โครงสร้างควบคุมเงื่อนไข

if----
<% if (condition) { %>
<% }else{ %>
<% } %>

for---
<% for(i=1;<10;i++) { %>
    (คำสั่งที่ต้องการทำซ้ำ)
<% } %>

array---
<% for(i = 0;i<product.length;i++){ %>
        <p><%= product[i] %></p>
    <% } %>

object---


การแทรก file ใน template
ในกรณีที่หน้าเว็บมีองค์ประกอบบางส่วนที่เหมือนกันเช่น header, footer เมื่อมีการปรับปรุงแก้ไขคำสั่งในพื้นที่หรือองค์ประกอบดังกล่าว
เราต้องปรับ code ในทุกๆหน้าเพื่อให้ได้ผลลัพธ์ที่เหมือนกัน วิธีการที่จะแก้ปัญหาคือแยกส่วนประกอบดังกล่าวและสร้างเป็น file
และนำเข้ามาทำงานในภายหลัง

คำสั่ง <%- include(\ชื่อ file)  %>
*/