/* 
รู้จักกับ cookie
    การทำงานระหว่าง browser และ server นั้นจะเกิดขึ้นเมื่อ browser ส่ง request ไปที่ server response กลับมา
    การทำงานก็จะสิ้นสุดลงเมื่อปิด browser ข้อมูลต่างๆที่แสดงใน web page ก็จะถูกทำลายไป แต่ถ้าเราต้องการอยากจะให้
    web page คงสถานะหรือเชื่อมโยงการทำงานระหว่าง web page เข้าด้วยกันได้จะอาศัยส่วนที่เรียกว่า cookie และ session

คุณสมบัติของ cookie
    -   ข้อมูลคุกกี้จะเก็บ file text ธรรมดา ซึ่ง cookie ของแต่ละ web จะถูกแยกคนละ file
    -   cookie มีระดับความปลอดภัยที่ค่อนข้างต่ำ เนื่องจากเก็บที่ฝั่งผู้ใช้ (client/browser) จึงเหมาะจะใช้เก็บข้อมูลที่ไม่เป็นความลับ
    -   ในกรณีที่ cookie หมดอายุหรือ file ที่เก็บข้อมูล cookie เสียหายก็จะไม่สามารถใช้งาน cookie ได้

*/